# ABLATION C: NO SCCONV
# YOLO11-M-Ablation-R2-SRUConv-only.yaml
# ============================================================
# ABLATION STUDY — Run R2
# Modules active  : SRU-Conv (backbone) ONLY
# Modules removed : DySample → replaced with nn.Upsample
#                   ResEMA   → removed (neck uses plain C3k2 output)
# Purpose: isolate the contribution of SRU-Conv alone
# Compare R1 (baseline) vs R2 to see SRU-Conv gain
# ============================================================

nc: 9
scales:
  # [depth, width, max_channels]
  #n: [0.50, 0.25, 1024]  
  #s: [0.50, 0.50, 1024]  
   m: [0.50, 1.00, 512]   
  #l: [1.00, 1.00, 512]    


nc: 9

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4

  # SRU-Conv ACTIVE — same as full model
  - [-1, 2, C3k2_SC, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8

  # SRU-Conv ACTIVE — same as full model
  - [-1, 2, C3k2_SC, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16

  # SRU-Conv ACTIVE — same as full model
  - [-1, 2, C3k2_SC, [512, True]]        # 6
  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32

  # SRU-Conv ACTIVE — same as full model
  - [-1, 2, C3k2_SC, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, C2PSA, [1024]]               # 10

head:
  # --- NECK STAGE 1: Upsample P5 -> P4 ---
  # DySample REMOVED — standard nn.Upsample replaces it
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12
  - [-1, 2, C3k2, [512, False]]                # 13
  # ResEMA REMOVED — no attention after C3k2
  # (layer 14 from full model is absent — layer numbers shift down by 1)

  # --- NECK STAGE 2: Upsample P4 -> P3 ---
  # DySample REMOVED — standard nn.Upsample replaces it
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15
  - [-1, 2, C3k2, [256, False]]                # 16
  # ResEMA REMOVED — no attention after C3k2

  # --- NECK STAGE 3: Downsample P3 -> P4 ---
  - [-1, 1, Conv, [256, 3, 2]]                 # 17
  - [[-1, 13], 1, Concat, [1]]                 # 18  (skip from layer 13, not 14)
  - [-1, 2, C3k2, [512, False]]                # 19
  # ResEMA REMOVED — no attention after C3k2

  # --- NECK STAGE 4: Downsample P4 -> P5 ---
  - [-1, 1, Conv, [512, 3, 2]]                 # 20
  - [[-1, 10], 1, Concat, [1]]                 # 21  (skip from C2PSA)
  - [-1, 2, C3k2, [1024, True]]                # 22
  # ResEMA REMOVED — no attention after C3k2

  # --- DETECT HEAD ---
  # Detection from: P3 (layer 16), P4 (layer 19), P5 (layer 22)
  - [[16, 19, 22], 1, Detect, [nc]]